# Sorting, Reindexing, Renaming, Dropping

In [2]:
import pandas as pd

In [3]:
# Create a DataFrame with dummy data.
df = pd.DataFrame(data={'staff_no': [9999] * 5,
                        'name': ['Dean McGrath'] * 5,
                        'year': [2016, 2017, 2018, 2019, 2020],
                        'hours': [349, 231, 876, 679, 976]},
                        index=[2,6,4,8,9])
df

   staff_no          name  year  hours
2      9999  Dean McGrath  2016    349
6      9999  Dean McGrath  2017    231
4      9999  Dean McGrath  2018    876
8      9999  Dean McGrath  2019    679
9      9999  Dean McGrath  2020    976

In [4]:
df.sort_values('hours')

   staff_no          name  year  hours
6      9999  Dean McGrath  2017    231
2      9999  Dean McGrath  2016    349
8      9999  Dean McGrath  2019    679
4      9999  Dean McGrath  2018    876
9      9999  Dean McGrath  2020    976

In [5]:
df.sort_values('year', ascending=False)

   staff_no          name  year  hours
9      9999  Dean McGrath  2020    976
8      9999  Dean McGrath  2019    679
4      9999  Dean McGrath  2018    876
6      9999  Dean McGrath  2017    231
2      9999  Dean McGrath  2016    349

In [6]:
# Rename the columns of a DataFrame
df.rename(columns = {'staff_no':'ID'})

     ID          name  year  hours
2  9999  Dean McGrath  2016    349
6  9999  Dean McGrath  2017    231
4  9999  Dean McGrath  2018    876
8  9999  Dean McGrath  2019    679
9  9999  Dean McGrath  2020    976

In [7]:
# Sort the index of a DataFrame
df.sort_index(ascending=False)

   staff_no          name  year  hours
9      9999  Dean McGrath  2020    976
8      9999  Dean McGrath  2019    679
6      9999  Dean McGrath  2017    231
4      9999  Dean McGrath  2018    876
2      9999  Dean McGrath  2016    349

In [8]:
# Reset index of DataFrame to row numbers, moving index to columns.
df.reset_index()

   index  staff_no          name  year  hours
0      2      9999  Dean McGrath  2016    349
1      6      9999  Dean McGrath  2017    231
2      4      9999  Dean McGrath  2018    876
3      8      9999  Dean McGrath  2019    679
4      9      9999  Dean McGrath  2020    976

In [10]:
# Drop columns from DataFrame
df.drop(columns=['name', 'staff_no'])

   year  hours
2  2016    349
6  2017    231
4  2018    876
8  2019    679
9  2020    976